// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// All tests for Arduino Dev Boards V.2
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
#include <Arduino.h>
#include "LedControl.h" // Для работы 8х8 светодиодной матрицы
#include <Wire.h>

LedControl lc = LedControl(5, 6, 7, 1);
/*
  Теперь настраиваем объект LedControl.
  Эти номера контактов, возможно, не будут работать в вашем проекте.
  Если необходимо, поменяйте их.
  5-ый контакт подключен к DIN.
  6-ый контакт подключен к CLK.
  7-ый контакт подключен к CS.
  У нас есть только один MAX72XX.
 */



// Функция 8х8 светодиодной матрицы
void ledMatrix();

void setup() {
  Serial.begin(9600);
  // Светодиодная матрица 8х8
  lc.shutdown(0, false);// Выключить энергосбережение, включить матрицу
  lc.setIntensity(0, 1);// Устанавлить яркость (0 ~ 15 возможных значений)
  lc.clearDisplay(0);// Очистить матрицу
}

void loop() {
  ledMatrix();
  
}

void ledMatrix() {
  // Проверка 8х8 светодиодной матрицы
  //lc.setLed(0, 3, 4, true);
  lc.setRow(0, 0, B00000000);
  lc.setRow(0, 1, B00111100);
  lc.setRow(0, 2, B01111110);
  lc.setRow(0, 3, B01111110);
  lc.setRow(0, 4, B01111110);
  lc.setRow(0, 5, B01111110);
  lc.setRow(0, 6, B00111100);
  lc.setRow(0, 7, B00000000);
  delay(2000);
  lc.setRow(0, 0, B00000000);
  lc.setRow(0, 1, B00000000);
  lc.setRow(0, 2, B00000000);
  lc.setRow(0, 3, B00000000);
  lc.setRow(0, 4, B00000000);
  lc.setRow(0, 5, B01111110);
  lc.setRow(0, 6, B01111110);
  lc.setRow(0, 7, B00000000);
  delay(50);
  lc.setRow(0, 0, B00000000);
  lc.setRow(0, 1, B01111000);
  lc.setRow(0, 2, B11111100);
  lc.setRow(0, 3, B11111100);
  lc.setRow(0, 4, B11111100);
  lc.setRow(0, 5, B11111100);
  lc.setRow(0, 6, B01111000);
  lc.setRow(0, 7, B00000000);
  delay(1000);
  lc.setRow(0, 0, B00000000);
  lc.setRow(0, 1, B00011110);
  lc.setRow(0, 2, B00111111);
  lc.setRow(0, 3, B00111111);
  lc.setRow(0, 4, B00111111);
  lc.setRow(0, 5, B00111111);
  lc.setRow(0, 6, B00011110);
  lc.setRow(0, 7, B00000000);
  delay(1000);
 
}


// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //